{
	"version": "1.0",
	"description": "Bonded Stablecoin Factory AA.",
	"homepage_url": "https://ostable.org",
	"source_url": "https://github.com/byteball/bonded-stablecoin",
	"field_descriptions": {
		"reserve_asset": "Reserve asset.",
		"reserve_asset_decimals": "Reserve asset decimals.",
		"decimals1": "Token1 decimals.",
		"decimals2": "Token2 decimals.",
		"m": "m of the curve.",
		"n": "n of the curve.",
		"leverage": "Leverage.",
		"interest_rate": "Interest rate (set 0.1 for 10%).",
		"fee_multiplier": "Fee multiplier for fees charged for moving the price away from the peg.",
		"slow_capacity_share": "Share of fees allocated to the slow capacity pool (set 0.5 for 50%).",
		"moved_capacity_share": "Share of capacity moved from slow to fast pool (set 0.1 for 10%).",
		"threshold_distance": "Distance from the target price that activates movement of capacity from the slow to the fast pool.",
		"move_capacity_timeout": "How long (in seconds) the price should be away from the target to activate movement of capacity from the slow to the fast pool.",
		"allow_grants": "Whether to allow voting for grants. Set to 1 to allow.",
		"allow_oracle_change": "Whether to allow changing of oracles. Set to 1 to allow.",
		"oracle1": "Address of the first oracle.",
		"feed_name1": "Name of the data feed of the first oracle.",
		"op1": "What to do with the feed of the first oracle: '*' to multiply, '/' to divide.",
		"oracle2": "Address of the second oracle.",
		"feed_name2": "Name of the data feed of the second oracle.",
		"op2": "What to do with the feed of the second oracle: '*' to multiply, '/' to divide.",
		"oracle3": "Address of the third oracle.",
		"feed_name3": "Name of the data feed of the third oracle.",
		"op3": "What to do with the feed of the third oracle: '*' to multiply, '/' to divide.",
		"regular_challenging_period": "Challenging period (in seconds) for regular (not critically important) governance parameters.",
		"important_challenging_period": "Challenging period (in seconds) for important governance parameters such as oracles.",
		"freeze_period": "Freeze period (in seconds) when those who voted for the winning decision cannot withdraw their stake.",
		"proposal_min_support": "Minimum support required for a proposal to be approved (set 0.5 for 50%).",
		"deposits.min_deposit_term": "Minimum deposit term in seconds.",
		"deposits.challenging_period": "Challenging period (in seconds) for force-closing another user's deposit.",
		"deposits.challenge_immunity_period": "A period (in seconds) during which a new deposit cannot be used to challenge force-closing of another deposit.",
		"deposits.reporter_share": "Share of the deposit amount paid to those who successfully challenge a force-close (set 0.2 for 20%)."
	}
}